app/views/versions/_versions_list.html.erb

					<% if @page.nil? %>
                    	<td><%= link_to_page(version.page) %></td>
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 101 LIMIT 1