app/views/versions/show.html.erb

<% params[:action] = @version.class.name.gsub('UserVersion', 'User Version').gsub('BaselineProcessVersion', 'Baseline Process Version') + " V#{@version.version}" %>
<% @overview = raw "This page show the details of version #{link_to_version(@version, 'version')} of page #{link_to_page(@version.page)}" %>
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 101 LIMIT 1
SELECT `versions`.* FROM `versions` WHERE (page_id=101 and version is not null) ORDER BY version DESC LIMIT 1