app/controllers/login_controller.rb

  def login
    @wikis = Wiki.find(:all, :conditions => ['obsolete_on is null'])
    @login_message = AdminMessage.text('Login')
    if request.get?
      if  cookies[:epfwiki_id] && User.exists?(cookies[:epfwiki_id])
---
SELECT `users`.* FROM `users` WHERE (admin='C') LIMIT 1