app/controllers/pages_controller.rb

SELECT `pages`.* FROM `pages` WHERE `pages`.`type` IN ('WikiPage') AND `pages`.`rel_path` = 'new/guidances/supportingmaterials/supporting_material_template_D3F13112.html' AND `pages`.`site_id` = 4 LIMIT 1
SELECT `sites`.* FROM `sites` WHERE `sites`.`type` IN ('Wiki') AND `sites`.`folder` = 'mywiki2' LIMIT 1
SELECT `versions`.* FROM `versions` WHERE `versions`.`type` IN ('UserVersion') AND `versions`.`page_id` = 101 AND (version is not null)
---
  def view
    #--
    # TODO add 'Compare with previous' link
    #++
    logger.debug("params[:url]:" + params[:url])
    s3,s4,s5 = params[:url].split('/').values_at(2,3,4)
    @rel_path = params[:url].sub("http://#{s3}/#{s4}/#{s5}/", '').split('?')[0] # url sometimes contains a parameter!
    logger.debug("Finding wiki by folder #{s4}")
    @wiki = Wiki.find_by_folder(s5)
    @page = WikiPage.find_by_rel_path_and_site_id(@rel_path, @wiki.id)
    if @page
      logger.debug("Page found")
      @version = @page.current_version
      @comments = Comment.find(:all, :conditions => ["page_id=? and site_id=?", @page.id, @wiki.id], :order => 'created_on ASC')

SELECT `checkouts`.* FROM `checkouts` WHERE `checkouts`.`id` = 16 LIMIT 1
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 101 LIMIT 1
SELECT `versions`.* FROM `versions` WHERE `versions`.`id` = 97 LIMIT 1
---
  def edit
    if params[:checkout_id]
      @checkout = Checkout.find(params[:checkout_id])
      v0 = @checkout.version.previous_version
      if v0.version == 0
        unless File.exists? v0.path(true) # we also want version 0 in TinyMCE format
          h = v0.html
          h = h.gsub(Page::BODY_TAG_PATTERN, '<body>')
          h = h.gsub(Page::TREEBROWSER_PATTERN, Page::TREEBROWSER_PLACEHOLDER)
          h = h.gsub(Page::HEAD_PATTERN, '')
          @version0_html = h
        end
      end
      @page = @checkout.page

SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 101 LIMIT 1
SELECT `versions`.* FROM `versions` WHERE `versions`.`type` IN ('UserVersion') AND `versions`.`page_id` = 101 AND (version is not null)
SELECT `checkouts`.* FROM `checkouts` WHERE `checkouts`.`version_id` = 96 LIMIT 1
SELECT `sites`.* FROM `sites` WHERE `sites`.`type` IN ('Wiki') AND `sites`.`id` = 4 LIMIT 1
INSERT INTO `checkouts` (`created_on`, `page_id`, `site_id`, `updated_on`, `user_id`, `version_id`) VALUES ('2012-07-08 06:32:16', 101, 4, '2012-07-08 06:32:16', 1, 97)
INSERT INTO `versions` (`baseline_process_id`, `created_on`, `current`, `done`, `note`, `page_id`, `rel_path`, `review_note`, `review_note_send_on`, `reviewer_id`, `type`, `update_id`, `updated_on`, `user_id`, `version`, `version_id`, `wiki_id`) VALUES (NULL, '2012-07-08 06:32:16', NULL, 'N', '', 101, 'new/guidances/supportingmaterials/supporting_material_template_D3F13112.html_EPFWIKI_co.html', NULL, NULL, NULL, 'UserVersion', NULL, '2012-07-08 06:32:16', 1, NULL, 96, 4)
---
  def checkout
    if request.get?
      @version = UserVersion.new
      @page = Page.find(params[:id])
      @wiki = @page.site
      #--
      #@wiki = Wiki.find_by_folder(params[:site_folder])
      # TODO these kind of statement are no longer necessary,
      # do global search and replace
      #++
      @version.wiki = @wiki
      co = @page.checkout
      if co
        redirect_to :action => 'edit', :checkout_id => co.id
      else
        @version.source_version = @page.current_version
      end
    else
      logger.info("Creating new checkout using params #{params[:user_version].inspect}")
      @version = UserVersion.new(params[:user_version])
      @version.source_version = Version.find(@version.version_id) # TODO
      @page = @version.source_version.page
      @wiki = @page.site
      co = Checkout.new(:note => @version.note, :page => @page, :site => @wiki, :source_version => @version.source_version, :user => session_user, :version => @version )
      if co.save

SELECT `checkouts`.* FROM `checkouts` WHERE `checkouts`.`id` = 17 LIMIT 1
---
  def save
    @checkout = Checkout.find(params[:checkout_id])

SELECT `checkouts`.* FROM `checkouts` WHERE `checkouts`.`id` = 15 LIMIT 1
SELECT MAX(`versions`.`version`) AS max_id FROM `versions` WHERE (page_id=101 and wiki_id = 4)
SELECT `checkouts`.* FROM `checkouts` WHERE `checkouts`.`version_id` = 95 LIMIT 1
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 101 LIMIT 1
SELECT `sites`.* FROM `sites` WHERE `sites`.`type` IN ('Wiki') AND `sites`.`id` = 4 LIMIT 1
UPDATE `versions` SET `version` = 3, `rel_path` = 'new/guidances/supportingmaterials/supporting_material_template_D3F13112.html_EPFWIKI_v3.html', `updated_on` = '2012-07-08 06:27:01' WHERE `versions`.`type` IN ('UserVersion') AND `versions`.`id` = 96
SELECT `notifications`.* FROM `notifications` WHERE (page_id=101 and notification_type='Page' and user_id=1) LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def checkin
    if params[:checkout_id]
      logger.info("Finding checkout with id #{params[:checkout_id]}")
      co = Checkout.find(params[:checkout_id])
      @version = co.version
      @wiki = co.site
      @page = co.page
      co.checkin(session_user, params[:html]) # will create Notification record
      if params[:html_v0] # will only be present when previous version is version 0
        @version0 = co.version.previous_version
        @version0.save_tinymce_html(params[:html_v0])
      end
      raise "Failed to checkin #{checkout.id}" if Checkout.exists?(co.id)
      flash.now['success'] = FLASH_CHECKIN_SUCCESS
      users = (User.find(:all, :conditions => ['notify_immediate=?', 1]) + Notification.find_all_users(@page, Page.name)).uniq

SELECT `checkouts`.* FROM `checkouts` WHERE `checkouts`.`id` = 16 LIMIT 1
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 101 LIMIT 1
SELECT `sites`.* FROM `sites` WHERE `sites`.`type` IN ('Wiki') AND `sites`.`id` = 4 LIMIT 1
---
  def undocheckout
    co = Checkout.find(params[:checkout_id])
    page = co.page
    wiki = co.site
    if mine?(co) || cadmin?
      co.undo
      if  Checkout.exists?(co.id)

SELECT `pages`.* FROM `pages` WHERE `pages`.`type` IN ('WikiPage') AND (rel_path = 'new/guidances/supportingmaterials/supporting_material_template_D3F13112.html' and id <> 101)
SELECT COUNT(*) FROM `versions` WHERE (page_id =101 and baseline_process_id is null)
SELECT `checkouts`.* FROM `checkouts` WHERE `checkouts`.`version_id` = 87 LIMIT 1
SELECT `versions`.* FROM `versions` WHERE `versions`.`type` IN ('UserVersion') AND `versions`.`page_id` = 101 AND (version is not null)
---
  def history # TODO test
    @page = Page.find(params[:id])
    @wiki = Wiki.find_by_folder(params[:site_folder])
    @versions = @page.versions
    @versions << @page.checkout.version unless @page.checkout.nil?
    @other_versions = Version.find(:all, :conditions => ['wiki_id<>? and page_id=?', @wiki.id, @page.id], :order=> 'wiki_id, version ASC')