app/controllers/versions_controller.rb

SELECT `versions`.* FROM `versions` WHERE (page_id=101 and version is not null) ORDER BY version DESC LIMIT 1
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 101 LIMIT 1
---
  def show
    @version = Version.find(params[:id])
    @page = @version.page